<template>
    <div v-if="!showConfidentialityAgreement">
        <div class="bodyfootermain">
            <div class="bodyconteiner">
                <h1>Fabila | Соглашение о конфиденциальности</h1>
                <div>
                    <p style="text-align: justify">
                        <span style="font-size: 11pt;">
                            1. Общие положения<br>
                            Настоящая Политика конфиденциальности распространения и хранения персональных данных (обезличенных) (далее – «Политика») действует в отношении информации, которую Администрация сайта Fabila (далее – «Сайт) может получить о физическом лице (далее - именуемом «Пользователь») при заполнении формы для регистрации на Сайте, а также в процессе дальнейшего использования Сайта.<br>
                            Заполнение данных в форме, представленной на Сайте при регистрации, означает безоговорочное согласие Пользователя на распространение и хранение его персональных данных в рамках Политики, а также согласие с настоящей Политикой и указанными в ней условиями распространения персональных данных Пользователя. В случае несогласия с этими условиями Пользователь должен воздержаться от заполнения формы регистрации на Сайте.<br>
                            Настоящая Политика описывает порядок распространения, хранения и защиты персональных данных (обезличенных) – действия (операции) или совокупность действий, направленные на распространение, т.е. раскрытие неопределенному кругу лиц.<br>
                            Отношения, связанные с распространением, хранением и защитой персональных данных и информации о Пользователях Сайта, регулируются настоящей Политикой, иными официальными документами Администрации и действующим законодательством РФ.<br>
                            Настоящая Политика регулирует распространение, хранение и защиту персональных данных и информации о физических лицах, которые планируют стать Пользователями Сайта, либо уже являются его Пользователями.<br>
                            Настоящая Политика применима только к Сайту Администрация. При этом Администрация не контролирует и не несет ответственность за сайты третьих лиц, на которые Пользователь может перейти по ссылкам, доступным на Сайте. На таких сайтах у Пользователя может собираться или запрашиваться иная персональная информация, а также могут совершаться иные действия.<br>
                            Администрация Сайта не проверяет достоверность персональной информации, предоставляемой Пользователями, и не осуществляет контроль за их дееспособностью, но при этом исходит из того, что Пользователь предоставляет достоверную и достаточную персональную информацию по вопросам, предлагаемым в форме запроса (заявки), и поддерживает эту информацию в актуальном состоянии.<br>
                            Администрация предпринимает меры предосторожности, включая правовые, организационные, административные, технические и физические для обеспечения защиты персональных данных Пользователей в соответствии с действующим законодательством о персональных данных, положениями настоящего соглашения, в том числе, обнаружение несанкционированного доступа к персональным данным и принятие мер по обнаружению, предупреждению и ликвидации последствий компьютерных атак на информационные системы персональных данных и по реагированию на компьютерные инциденты в них; восстановление персональных данных, модифицированных или уничтоженных вследствие несанкционированного доступа к ним.<br>
                            Персональные данные Пользователя уничтожаются при отзыве Пользователем согласия на распространение, использование и хранение персональных данных.<br><br>
                            2. Персональные данные Пользователей, которые получает Администрация.<br>
                            Под персональными данными в настоящей Политике понимаются персональные данные (обезличенные), разрешенные субъектом персональных данных для распространения, т.е. сведения о субъекте, которые субъект предоставил самостоятельно неограниченному кругу лиц путем дачи согласия на распространение этих персональных данных при регистрации на Сайте и в процессе дальнейшего использования Сайта. При этом под распространением персональных данных понимаются действия, направленные на их раскрытие неопределенному кругу лиц.<br>
                            При регистрации на Сайте вправе получать и распространять информацию от Пользователя, включая:<br>
                            - фамилию, имя, отчество Пользователя (при этом Пользователь вправе указать только свой псевдоним);<br>
                            - адрес электронной почты (e-mail).<br>
                            Указанные данные размещаются на Сайте и в дальнейшем хранятся в информационной базе данных до момента их отзыва Пользователем, при этом персональные данные используются исключительно в оговоренных в настоящей Политике целях.<br>
                            Помимо персональных данных Сайтом автоматически передаются полученные в процессе его использования с помощью установленного на устройстве Пользователя программного обеспечения данные, в том числе IP-адрес, информация из cookie, информация о браузере пользователя (или иной программе, с помощью которой осуществляется доступ к сайту), время доступа, адрес запрашиваемой страницы.<br>
                            При принятии Пользователем решения об использовании услуг, предлагаемых в рамках функционала, представленного на Сайте с согласия Пользователя, выраженного в предоставлении Администрации такой информации, вправе получать иную информацию, предоставляемую Пользователем, но исключительно в целях исполнения обязательств по договору (в том числе представленному в виде публичной оферты на сайте), либо иному соглашению, заключаемому между Пользователем и Сайтом. Факт предоставления Пользователем запрашиваемой Администрации информации означает полное и безоговорочное согласие на ее предоставление и последующее распространение в рамках закона.<br><br>
                            3. Цели использования персональных данных<br>
                            Целью использования персональных данных является осуществление обратной связи с Пользователем для рассылки информации о работе Сайта, а также для согласования всех условий возможного последующего сотрудничества в рамках платных услуг, предлагаемых Сайтом.<br>
                            Сайт вправе запросить у Пользователя персональные данные при заполнении информации о Пользователе. Администрация может использовать такие данные в соответствии с настоящей Политикой и действующим законодательством РФ.<br>
                            Администрация вправе использовать предоставленную Пользователем информацию, в том числе персональные данные, в целях обеспечения соблюдения требований действующего законодательства Российской Федерации (в целях предупреждения и/или пресечения незаконных и/или противоправных действий Пользователей). Раскрытие предоставленной Пользователем информации может быть произведено лишь в соответствии с действующим законодательством Российской Федерации по требованию суда, правоохранительных органов, а равно в иных предусмотренных законодательством Российской Федерации случаях.<br><br>
                            4. Условия использования и распространения персональных данных Пользователя<br>
                            Администрация хранит персональные данные Пользователей в соответствии с внутренними регламентами конкретных сервисов и информационных систем. В отношении персональной информации Пользователя сохраняется ее конфиденциальность. При использовании и распространении персональных данных Пользователей Администрация руководствуется Федеральным законом РФ от 27.07.2006 года № 152-ФЗ «О персональных данных».<br>
                            Персональные данные Пользователей не передаются каким-либо третьим лицам, за исключением случаев, прямо предусмотренных настоящей Политикой.<br>
                            Персональные данные Пользователя Администрация вправе использовать для:<br>
                            - связи с Пользователем, в том числе направления Пользователю в виде email-сообщений уведомлений и информации, касающихся услуг, которые Администрация может оказать Пользователю, а также новостных, рекламных и прочих рассылок от Сайта;<br>
                            - идентификации стороны в рамках договоров и соглашений с Сайтом;<br>
                            - предоставления Пользователю персонализированных услуг и сервисов;<br>
                            - направления сообщений по электронной почте с целью уточнения данных, указанных на Сайте.<br>
                            Если Пользователь не желает получать информационные, новостные, рекламные и иные рассылки от Сайта, он вправе в любое время отказаться от таких рассылок путём направления требования Администрации по указанным на Сайте контактам для обратной связи в свободной форме любым удобным для Пользователя способом, либо отписавшись от таких рассылок непосредственно перейдя по ссылке, предлагаемой в e-mail-сообщении.<br>
                            Согласие на использование, распространение и хранение персональных данных может быть отозвано Пользователем любым удобным для него способом (включая направление соответствующего запроса по адресу электронной почты Администрации Сайта contactfabila@gmail.com).<br><br>
                            5. Заключительные положения<br>
                            К настоящей Политике и отношениям между Пользователем и Администрацией сайта применяется действующее законодательство РФ.<br>
                            Пользователь вправе направлять Администрации свои запросы, в том числе запросы относительно использования его персональных данных, а таже отзывы на использование, распространение и хранение персональных данных.<br>
                            С целью дальнейшего совершенствования системы защиты от несанкционированного доступа к сообщаемым Пользователями персональным данным Администрация оставляет за собой право в любое время и по своему усмотрению, без согласия Пользователя, вносить изменения в Политику.<br>
                            После внесения изменений в настоящую Политику, на Сайте размещается обновленная версия Политики. Новая редакция Политики вступает в силу с момента ее размещения на Сайте, если иное не предусмотрено новой редакцией Политики.<br>
                            Если по тем или иным причинам одно или несколько положений настоящей Политики будут признаны недействительными или не имеющими юридической силы, это не оказывает влияния на действительность или применимость остальных положений.<br>
                        </span>
                    </p>
                </div>
            </div>
        </div>
    </div>
</template>
    
<script>
    import {defineComponent} from 'vue';

export default defineComponent({
    components: {},
    setup () {
        return {
            showConfidentialityAgreement: false,
        };
    },
});
</script>
      
<style>

</style>