<template>
    <div v-if="!showUserAgreement">
        <div class="bodyfootermain">
            <div class="bodyconteiner">
                <h1>Fabila | Пользовательское соглашение</h1>
                <div>
                    <p style="text-align: justify">
                        <span style="font-size: 11pt;">
                            Данное пользовательское соглашение (именуемое в дальнейшем Соглашение) представляет собой оферту условий по пользованию веб-сайтом Fabila (далее – Сайт), в лице Администрации сайта и физическим лицом (в том числе представителями юридических лиц) (именуемым в дальнейшем Пользователь), и регламентирующее условия предоставления Пользователем информации для размещения на Сайте.<br>
                            Пользователем Сайта считается любое физическое лицо, когда-либо осуществившее доступ к Сайту, достигшее возраста, допустимого для акцепта настоящего Соглашения.<br>
                            Настоящее Соглашение может быть изменено и/или дополнено Администрацией Сайта в одностороннем порядке без какого-либо специального уведомления. Настоящие Правила являются открытым и общедоступным документом.<br>
                            Соглашение предусматривает взаимные права и обязанности Пользователя и Администрации Сайта.<br><br>
                            Сайт позволяет Пользователю просматривать и загружать информацию с сайта исключительно для личного некоммерческого использования. Запрещается изменять материалы сайта, распространять для общественных или коммерческих целей.<br>
                            При регистрации на сайте и оформлении заказов, Пользователь соглашается предоставить достоверную и точную информацию о себе и своих контактных данных.<br>
                            В процессе регистрации на сайте, Пользователь получает логин и пароль за безопасность, которых несет персональную ответственность.<br>
                            Пользователь может обращаться к Администрации сайта с вопросами, претензиями, пожеланиями по улучшению работы, либо с какой-либо иной информацией. При этом Пользователь несет ответственность, что данное обращение не является незаконным, угрожающим, нарушает авторские права, дискриминацию людей по какому-либо признаку, а также содержит оскорбления либо иным образом нарушает действующее законодательство РФ.<br><br>
                            Администрация сайта с уважением и ответственностью относится к конфиденциальной информации любого лица, ставшего посетителем этого сайта. Принимая это Соглашение Пользователь дает согласие на сбор, обработку и использование определенной информации о Пользователе в соответствии с положениями ФЗ-152 "О защите персональных данных". Кроме того, пользователь дает согласие, что Администрация сайта может собирать, использовать, передавать, обрабатывать и поддерживать информацию, связанную с аккаунтом Пользователя с целью предоставления соответственных услуг.<br>
                            Администрация сайта обязуется осуществлять сбор только той персональной информации, которую Потребитель предоставляет добровольно в случае, когда информация нужна для предоставления (улучшения) услуг Потребителю.<br>
                            Администрация сайта собирает как основные персональные данные, такие как имя, фамилия, отчество, адрес и электронный адрес, так и вторичные (технические) данные - файлы cookies, информация о соединениях и системная информация.<br>
                            Пользователь соглашается с тем, что конфиденциальность переданных через Интернет данных не гарантирована в случае, если доступ к этим данным получен третьими лицами вне зоны технический средств связи, подвластных Администрации сайта, Администрация сайта не несет ответственности за ущерб, нанесенный таким доступом.<br>
                            Администрация сайта может использовать любую собранную через Сайт информацию с целью улучшения содержания интернет-сайта, его доработки, передачи информации Пользователю (по запросам), для маркетинговых или исследовательских целей, а также для других целей, не противоречащим положениям действующего законодательства РФ.<br><br>
                            Администрация сайта не несет никакой ответственности за любые ошибки, опечатки и неточности, которые могут быть обнаружены в материалах, содержащихся на данном Сайте. Администрация сайта прикладывает все необходимые усилия, чтобы обеспечить точность и достоверность представляемой на Сайте информации.<br>
                            Информация на Сайте постоянно обновляется и в любой момент может стать устаревшей. Администрация сайта не несет ответственности за получение устаревшей информации с Сайта, а также за неспособность Пользователя получить обновления хранящейся на Сайте информации.<br>
                            Администрация сайта не несет никакой ответственности за высказывания и мнения посетителей сайта, оставленные в качестве комментариев или обзоров. Мнение Администрация сайта может не совпадать с мнением и позицией авторов обзоров и комментариев. В то же время Администрация сайта принимает все возможные меры, чтобы не допускать публикацию сообщений, нарушающих действующее законодательство или нормы морали.,<br>
                            Администрация сайта не несет ответственности за возможные противоправные действия Пользователя относительно третьих лиц, либо третьих лиц относительно Пользователя.<br>
                            Администрация сайта не несет ответственности за высказывания Пользователя, произведенные или опубликованные на Сайте.<br>
                            Администрация сайта не несет ответственности за ущерб, убытки или расходы (реальные либо возможные), возникшие в связи с настоящим Сайтом, его использованием или невозможностью использования.<br>
                            Администрация сайта не несет ответственности за утерю Пользователем возможности доступа к своему аккаунту — учетной записи на Сайте.<br>
                            Администрация сайта не несет ответственности за неполное, неточное, некорректное указание Пользователем своих данных при создании учетной записи Пользователя.<br>
                            При возникновении проблем в использовании Сайта, несогласия с конкретными разделами Пользовательского соглашения, либо получении Пользователем недостоверной информации от третьих лиц, либо информации оскорбительного характера, любой иной неприемлемой информации, пожалуйста, обратитесь к администрации Сайта для того, чтобы Администрация сайта могла проанализировать и устранить соответствующие дефекты, ограничить и предотвратить поступление на Сайт нежелательной информации, а также, при необходимости, ограничить либо прекратить обязательства по предоставлению своих услуг любому Пользователю и клиенту, умышленно нарушающему предписания Соглашения и функционирование работы Сайта.<br>
                            В целях вышеизложенного Администрация сайта оставляет за собой право удалять размещенную на Сайте информацию и предпринимать технические и юридические меры для прекращения доступа к Сайту Пользователей, создающих согласно заключению Администрация сайта, проблемы в использовании Сайта другими Пользователями, или Пользователей, нарушающих требования Соглашения.<br><br>
                            Настоящее Соглашение является договором. Администрация сайта оставляет за собой право как изменить настоящее Соглашение, так и ввести новое. Подобные изменения вступают в силу с момента их размещения на Сайте. Использование Пользователем материалов сайта после изменения Соглашения автоматически означает их принятие.<br>
                            Данное Соглашение вступает в силу при первом посещении Сайта Пользователем и действует между Пользователем и Компанией на протяжении всего периода использования Пользователем Сайта.,<br>
                            Сайт является объектом права интеллектуальной собственности Администрации сайта. Все исключительные имущественные авторские права на сайт принадлежат Администрации сайта. Использование сайта Пользователями возможно строго в рамках Соглашения и законодательства РФ о правах интеллектуальной собственности.<br>
                            Все торговые марки и названия, на которые даются ссылки в материалах настоящего Cайта, являются собственностью их соответствующих владельцев.<br>
                            Пользователь соглашается не воспроизводить, не повторять, не копировать, какие-либо части Сайта, кроме тех случаев, когда такое разрешение дано Пользователю Администрацией сайта.<br>
                            Настоящее Соглашение регулируется и толкуется в соответствии с законодательством РФ. Вопросы, не урегулированные Соглашением, подлежат разрешению в соответствии с законодательством РФ. Защита персональных данных Уважаемый Пользователь, регистрируясь на нашем сайте или используя различные сервисы нашего сайта, которые требуют ввода Ваших личных данных, Вы даёте согласие на обработку своих персональных данных согласно ФЗ-152 «О защите персональных данных», а также согласованным и утвержденным Правилам. Администрация сайта оставляет за собой право на использование данной информации в маркетинговых целях в рамках предоставления услуг. Пользователь, регистрируясь на сайте Fabila (далее – «Сайт»), в том числе, создавая свой аккаунт и/или регистрируясь в качестве пользователя каких-либо сервисов Сайта, в случае осуществления соответствующих действий под собственным и действительным (а не выдуманным) именем, дает свое согласие собственнику Сайта на обработку персональных данных Пользователя (ФИО, пол, возраст, местожительства, дата и место рождения, контактных данных в случае предоставления такой информации и при условии, что такая информация является правдивой и действительной). Пользователь дает согласие собственнику Сайта на осуществление действий в информационной (автоматизированной) системе и/или в картотеках персональных данных, которые связаны со сбором, регистрацией, накоплением, хранением, адаптированием, изменением, обновлением, использованием и распространением (реализацией, передачей), обезличением, уничтожением соответствующих персональных данных и ведомостей о Пользователе – физическом лице. Пользователь также дает собственнику Сайта право определять на собственное усмотрение порядок использования персональных данных Пользователя (в том числе порядок использования персональных данных работниками собственника Сайта в соответствии с их профессиональными или служебными, или трудовыми обязанностями), порядок защиты, распространения, порядок доступа к базам данных и порядок передачи права обработки персональных данных другими субъектами отношений, связанных с персональными данными. Пользователь предоставляет указанные права собственнику Сайта с целью соблюдения последним требований действующего законодательства о защите персональных данных.<br>
                        </span>
                    </p>
                </div>
            </div>
        </div>
    </div>
</template>
    
<script>
    import {defineComponent} from 'vue';

export default defineComponent({
    components: {},
    setup () {
        return {
            showUserAgreement: false,
        };
    },
});
</script>
      
<style>

.bodyfootermain {
    padding-left: 20px;
    padding-right: 20px;
    margin: 24px 0;
    height: 100%;
    flex: 1 1;
    width: 100%;
}

.bodyconteiner {
    margin: 0 auto;
    padding: 0 0 40px;
    max-width: 980px;
    padding-top: 20px;
}

.bodyconteiner h1 {
    margin: 16px 0 32px;
    font-size: 28px;
    font-weight: bold;
}

.h1 {
    display: block;
    font-size: 28px;
    margin-block-start: 0.67em;
    margin-block-end: 0.67em;
    margin-inline-start: 0px;
    margin-inline-end: 0px;
    font-weight: bold;
    unicode-bidi: isolate;

}

.bodyconteiner p {
    padding-bottom: 12px;
    font-size: 16px;
}

.p {
    margin: 4px 0;
    font-weight: 400;
    line-height: 1.6;
}

</style>